from django.shortcuts import render
import random

# Create your views here.

talk = ""
fe = ["谢曼","明林","谢远南","王仪","明华","濮阳思弦","袁娴","冯南金","闻霏","鹿叶","梅思柔","谢莫莫","谢雪霏"]
ppl=["刃一","刃十一","苍何","苍时","谢曼","苍庆之","谢子迁","明林","谢彦休","谢述","谢谦","谢远南","王漠","王仪","王携之","王谚","明华","明正藻","明彦昭","濮阳思弦","袁娴","昆巽止","宿重","冯南金","闻霏","鹿叶","谢子文","梅思柔","谢莫莫","谢雪霏","谢札","谢胜"]
act = ["接吻","打架","做爱","吵架","殉情","弹琴","下棋","读话本","学习","画画","喝酒","泡茶","养花","骑马","练武功","包扎伤口","打算盘","数钱","救人","做饭","吃饭","暗杀对方","沙盘推演","赏花","偷情","打牌","修仙","搞sm","互相嘲讽","嘲讽别人","赞美对方","赞美长公主"]
place = ["集市","桐宫","御书房","鹤水河畔","珍宝阁","长公主府","清音坊","西树","北狐","天香楼","屋顶上","军营里","床上","野外","后宫"]
emo = ["快乐","悲伤","生气","疯狂","舒畅","小心翼翼","烦闷","兴奋","迷惑","羞耻"]
act2 = ["暗中观察","阻止他们","加入他们","毫无察觉","无视他们","扣了所有人","被扣了"]

def gen(n):
    return n[random.randint(0, len(n) - 1)]

def gen_mes():
    text = "{}和{}在{}{}地{}，\n长公主{}".format(gen(fe), gen(ppl), 
                                         gen(place), gen(emo), gen(act), gen(act2))
    return text

def index(request):

    context = {
        'message': gen_mes(),
    }
    if (request.GET.get('btn')):
        gen_mes()
        
    return render(request, 'index.html', context=context)

